docs/MOOC/ai_for_trading/terminologies.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-09-28 Tue 23:07 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Terminologies</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="ChrisChen" />
<link rel="stylesheet" type="text/css" href="https://gongzhitaao.org/orgcss/org.css">
</head>
<body>
<div id="content">
<h1 class="title">Terminologies</h1>
<dl class="org-dl">
<dt>Stock</dt><dd>An asset that represents ownership in a company. A claim on part of a corportation's assets and earnings. There are two main types, common and preferred.</dd>
<dt>Share</dt><dd>A single share represents partial ownership of a company relative to the total number of shares in existence.</dd>
<dt>Common Stock</dt><dd>One main type of stock; entitles the owner to receive dividends and to vote at shareholder meetings.</dd>
<dt>Preferred Stock</dt><dd>The other main type of stock; generally does not entail voting rights, but entitles the owner to a higher claim on the assets and earnings of a company.</dd>
<dt>Dividend</dt><dd>A partial distribution of a company's profits to shareholders.</dd>
<dt>Capital Gains</dt><dd>Profits that result from the sale of an asset at a price higher than the purchase price.</dd>
<dt>Security</dt><dd>A tradable financial asset.</dd>
<dt>Debt Security</dt><dd>Money that is owed and must be repaid, like government or corporate bonds, or certificates of deposit. Also called fixed-income securities.</dd>
<dt>Derivative Security</dt><dd>A financial instrument whereby its value is derived from other assets.</dd>
<dt>Equity</dt><dd>The value of an owned asset minus the amount of all debts on that asset.</dd>
<dt>Equity Security</dt><dd>A security that represents fractional ownership in an entity, such as stock.</dd>
<dt>Option Contract</dt><dd>A contract which gives the buyer the right, but not the obligation, to buy or sell an underlying asset at a specified price on or by a specified date</dd>
<dt>Futures Contract</dt><dd>A contract that obligates the buyer to buy or the seller to sell an asset at a predetermined price at a specified time in the future</dd>
<dt>Total Market Capitalization</dt><dd>The dollar value of a company's outstanding shares.</dd>
<dt>Inflection Point</dt><dd>拐点</dd>
<dt>Cross-sectional Analysis</dt><dd>Cross-sectional analysis looks at data collected at a single point in time, rather than over a period of time. OPP Time-series Analysis</dd>
<dt>Data-snooping(P-hacking)</dt><dd>The misuse of data analysis to find patterns in data by performing many statistical tests on the data and only reporting those that come back with significant results.</dd>
<dt>Backtesting</dt><dd>The process of rigorously simulating the entire flow in an automated fashion using historical data.</dd>
<dt>Alpha</dt><dd>An expression that outputs a vector of values which are proportional to the size of the position you will take on each asset.
<ul class="org-ul">
<li>The procedure that produces the ranks. The ranks themselves make up the <b>Alpha Vector</b>.</li>
</ul></dd>
<dt>Volume</dt><dd>Number of shares traded.</dd>
<dt>Turnover</dt><dd>Volume Traded \(\times\) Price Per Share</dd>
<dt>Contrarian Strategies</dt><dd>seek to identify sudden price movements and trade against such movements.(minute level data, risky)</dd>
<dt>Lookahead Bias</dt><dd>Incorporating the information from the future.(this misuse often make your results look better)</dd>
<dt>Signal to Noise Ratio</dt><dd>The signal is the meaningful part of input data. The noise is the random part of input data. The ratio is low for finance, the output models tend to <b>overfit</b> the data.</dd>
<dt>Quartiles</dt><dd>Quartiles are the three dividing lines that divide the data into four groups.</dd>
<dt>Take-profit Level</dt><dd>止盈线 Defined as a target price or a percent change from an entry price.</dd>
<dt>Stop-loss level</dt><dd>止损线</dd>
<dt>Book Value</dt><dd>The company's accounting value which is assets minus liabilities.</dd>
<dt>Free Float</dt><dd>The free float shares is the total shares minus shares that are not readily available in the market.</dd>
<dt>Active/Passive Funds</dt><dd>Active funds(aka Alpha funds) seek to outperform its benchmark, Passive funds(aka Index/Beta Funds) seek to track its benchmark.</dd>
<dt>Smart Beta (Portfolios)</dt><dd>active + passive fund management.</dd>
<dt>AUM</dt><dd>Assets Under Management</dd>
<dt>NAV</dt><dd>Net Asset Value
\[NAV=\frac{AUM-Expenses}{\text{number of shares}}\]
<ul class="org-ul">
<li>Expenses are the costs of running the fund. Often defined as a ratio called <b>Gross Expense Ratio</b></li>
<li><b>Net Expense Ratio</b> is a discount of <b>Gross Expense Ratio</b> which offers to early customers. (not permanent)</li>
</ul></dd>
<dt>Market-neutral</dt><dd>Gains and losses are less sensitive to movements in the overall market.</dd>
<dt>Roll Over Contract</dt><dd>Extend your position into the future, like renewing your gym membership.</dd>
</dl>
</div>
</body>
</html>
